<h1>Welcome to frame!</h1>
<p>
<img src="/images/main-page.png" align="left" >
<a href="/">andframe</a> - «Фреймворк» определяется как множество конкретных и абстрактных классов, а также определений способов их взаимоотношения. Конкретные классы обычно реализуют взаимные отношения между классами. Абстрактные классы представляют собой точки расширения, в которых каркасы могут быть использованы или адаптированы.
Точка расширения — это та «часть» фреймворка, для которой не приведена реализация. Соответственно, каркас концептуальной модели состоит из концептуальных классов, а каркас программной системы — из классов языка программирования общего назначения.
Процесс создания фреймворка заключается в выборе подмножества задач проблемы и их реализаций. В ходе реализаций, общие средства решения задач заключаются в конкретных классах, а изменяемые средства — выносятся в точки расширения.
    <a href="/">andframe</a>.
</p>